## **Pandas**

In [1]:
# instaling pandas

In [2]:
#!pip install pandas

In [3]:
#pip show pandas

In [4]:
import pandas as pd
import numpy as np

In [1]:
from pandas import pandas as pd

In [2]:
dir(pd)

['ArrowDtype',
 'BooleanDtype',
 'Categorical',
 'CategoricalDtype',
 'CategoricalIndex',
 'DataFrame',
 'DateOffset',
 'DatetimeIndex',
 'DatetimeTZDtype',
 'ExcelFile',
 'ExcelWriter',
 'Flags',
 'Float32Dtype',
 'Float64Dtype',
 'Grouper',
 'HDFStore',
 'Index',
 'IndexSlice',
 'Int16Dtype',
 'Int32Dtype',
 'Int64Dtype',
 'Int8Dtype',
 'Interval',
 'IntervalDtype',
 'IntervalIndex',
 'MultiIndex',
 'NA',
 'NaT',
 'NamedAgg',
 'Period',
 'PeriodDtype',
 'PeriodIndex',
 'RangeIndex',
 'Series',
 'SparseDtype',
 'StringDtype',
 'Timedelta',
 'TimedeltaIndex',
 'Timestamp',
 'UInt16Dtype',
 'UInt32Dtype',
 'UInt64Dtype',
 'UInt8Dtype',
 '__all__',
 '__builtins__',
 '__cached__',
 '__doc__',
 '__docformat__',
 '__file__',
 '__git_version__',
 '__loader__',
 '__name__',
 '__package__',
 '__path__',
 '__spec__',
 '__version__',
 '_built_with_meson',
 '_config',
 '_is_numpy_dev',
 '_libs',
 '_pandas_datetime_CAPI',
 '_pandas_parser_CAPI',
 '_testing',
 '_typing',
 '_version_meson',
 'annotations',
 'api',
 'array',
 'arrays',
 'bdate_range',
 'compat',
 'concat',
 'core',
 'crosstab',
 'cut',
 'date_range',
 'describe_option',
 'errors',
 'eval',
 'factorize',
 'from_dummies',
 'get_dummies',
 'get_option',
 'infer_freq',
 'interval_range',
 'io',
 'isna',
 'isnull',
 'json_normalize',
 'lreshape',
 'melt',
 'merge',
 'merge_asof',
 'merge_ordered',
 'notna',
 'notnull',
 'offsets',
 'option_context',
 'options',
 'pandas',
 'period_range',
 'pivot',
 'pivot_table',
 'plotting',
 'qcut',
 'read_clipboard',
 'read_csv',
 'read_excel',
 'read_feather',
 'read_fwf',
 'read_gbq',
 'read_hdf',
 'read_html',
 'read_json',
 'read_orc',
 'read_parquet',
 'read_pickle',
 'read_sas',
 'read_spss',
 'read_sql',
 'read_sql_query',
 'read_sql_table',
 'read_stata',
 'read_table',
 'read_xml',
 'reset_option',
 'set_eng_float_format',
 'set_option',
 'show_versions',
 'test',
 'testing',
 'timedelta_range',
 'to_datetime',
 'to_numeric',
 'to_pickle',
 'to_timedelta',
 'tseries',
 'unique',
 'util',
 'value_counts',
 'wide_to_long']

In [6]:
print(pd.__doc__)

pandas - a powerful data analysis and manipulation library for Python
=====================================================================

**pandas** is a Python package providing fast, flexible, and expressive data
structures designed to make working with "relational" or "labeled" data both
easy and intuitive. It aims to be the fundamental high-level building block for
doing practical, **real world** data analysis in Python. Additionally, it has
the broader goal of becoming **the most powerful and flexible open source data
analysis / manipulation tool available in any language**. It is already well on
its way toward this goal.

Main Features
-------------
Here are just a few of the things that pandas does well:

  - Easy handling of missing data in floating point as well as non-floating
    point data.
  - Size mutability: columns can be inserted and deleted from DataFrame and
    higher dimensional objects
  - Automatic and explicit data alignment: objects can be explicitly aligned
    to a set of labels, or the user can simply ignore the labels and let
    `Series`, `DataFrame`, etc. automatically align the data for you in
    computations.
  - Powerful, flexible group by functionality to perform split-apply-combine
    operations on data sets, for both aggregating and transforming data.
  - Make it easy to convert ragged, differently-indexed data in other Python
    and NumPy data structures into DataFrame objects.
  - Intelligent label-based slicing, fancy indexing, and subsetting of large
    data sets.
  - Intuitive merging and joining data sets.
  - Flexible reshaping and pivoting of data sets.
  - Hierarchical labeling of axes (possible to have multiple labels per tick).
  - Robust IO tools for loading data from flat files (CSV and delimited),
    Excel files, databases, and saving/loading data from the ultrafast HDF5
    format.
  - Time series-specific functionality: date range generation and frequency
    conversion, moving window statistics, date shifting and lagging.

In [7]:
data = np.array(['a','b','c','d','e'])
data1 = pd.Series(data, index=[1,2,3,4,5])
data1

1    a
2    b
3    c
4    d
5    e
dtype: object

In [8]:
data2 = pd.Series(data)
data2

0    a
1    b
2    c
3    d
4    e
dtype: object

In [9]:
print(pd.Series.__doc__)

One-dimensional ndarray with axis labels (including time series).

Labels need not be unique but must be a hashable type. The object
supports both integer- and label-based indexing and provides a host of
methods for performing operations involving the index. Statistical
methods from ndarray have been overridden to automatically exclude
missing data (currently represented as NaN).

Operations between Series (+, -, /, \*, \*\*) align values based on their
associated index values-- they need not be the same length. The result
index will be the sorted union of the two indexes.

Parameters
----------
data : array-like, Iterable, dict, or scalar value
    Contains data stored in Series. If data is a dict, argument order is
    maintained.
index : array-like or Index (1d)
    Values must be hashable and have the same length as `data`.
    Non-unique index values are allowed. Will default to
    RangeIndex (0, 1, 2, ..., n) if not provided. If data is dict-like
    and index is None, then the keys in the data are used as the index. If the
    index is not None, the resulting Series is reindexed with the index values.
dtype : str, numpy.dtype, or ExtensionDtype, optional
    Data type for the output Series. If not specified, this will be
    inferred from `data`.
    See the :ref:`user guide <basics.dtypes>` for more usages.
name : Hashable, default None
    The name to give to the Series.
copy : bool, default False
    Copy input data. Only affects Series or 1d ndarray input. See examples.

Notes
-----
Please reference the :ref:`User Guide <basics.series>` for more information.

Examples
--------
Constructing Series from a dictionary with an Index specified

>>> d = {'a': 1, 'b': 2, 'c': 3}
>>> ser = pd.Series(data=d, index=['a', 'b', 'c'])
>>> ser
a   1
b   2
c   3
dtype: int64

The keys of the dictionary match with the Index values, hence the Index
values have no effect.

>>> d = {'a': 1, 'b': 2, 'c': 3}
>>> ser = pd.Series(data=d, index=['x', 'y', 'z'])
>>> ser
x   NaN
y   NaN
z   NaN
dtype: float64

Note that the Index is first build with the keys from the dictionary.
After this the Series is reindexed with the given Index values, hence we
get all NaN as a result.

Constructing Series from a list with `copy=False`.

>>> r = [1, 2]
>>> ser = pd.Series(r, copy=False)
>>> ser.iloc[0] = 999
>>> r
[1, 2]
>>> ser
0    999
1      2
dtype: int64

Due to input data type the Series has a `copy` of
the original data even though `copy=False`, so
the data is unchanged.

Constructing Series from a 1d ndarray with `copy=False`.

>>> r = np.array([1, 2])
>>> ser = pd.Series(r, copy=False)
>>> ser.iloc[0] = 999
>>> r
array([999,   2])
>>> ser
0    999
1      2
dtype: int64

Due to input data type the Series has a `view` on
the original data, so
the data is changed as well.

In [10]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva', 'Frank', 'Grace', 'Hannah', 'Ivan', 'Jack', 'Ivan', 'Jack', 'Grace', 'Hannah'],
    'Age': [45, 58, 60, 28, 49, 67, None, 60, 37, 31, 37, 31, 29, 60],
    'City': ['New York', 'London', 'Tokyo', 'Paris', 'Berlin', 'Paris', 'Berlin', 'New York', 'Tokyo', 'London', 'Tokyo', 'London', 'Berlin', 'New York'],
    'Salary': [95445, 86235, 62330, 46022, 65999, 88320, 57141, 65413, 87016, 58725, 87016, 58725, 57141, None],
    'Date': ['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04', '2023-01-05', '2023-01-06', '2023-01-07', '2023-01-08', '2023-01-09', '2023-01-10', '2023-01-09', '2023-01-10', '2023-01-07', '2023-01-08'],
    'Category': ['A', 'B', 'C', 'A', 'B', 'A', 'C', 'B', 'A', 'B', 'A', 'B', None, 'B']
}

In [11]:
df = pd.DataFrame(data)
df

       Name   Age      City   Salary        Date Category
0     Alice  45.0  New York  95445.0  2023-01-01        A
1       Bob  58.0    London  86235.0  2023-01-02        B
2   Charlie  60.0     Tokyo  62330.0  2023-01-03        C
3     David  28.0     Paris  46022.0  2023-01-04        A
4       Eva  49.0    Berlin  65999.0  2023-01-05        B
5     Frank  67.0     Paris  88320.0  2023-01-06        A
6     Grace   NaN    Berlin  57141.0  2023-01-07        C
7    Hannah  60.0  New York  65413.0  2023-01-08        B
8      Ivan  37.0     Tokyo  87016.0  2023-01-09        A
9      Jack  31.0    London  58725.0  2023-01-10        B
10     Ivan  37.0     Tokyo  87016.0  2023-01-09        A
11     Jack  31.0    London  58725.0  2023-01-10        B
12    Grace  29.0    Berlin  57141.0  2023-01-07     None
13   Hannah  60.0  New York      NaN  2023-01-08        B

### **Data Ingestion or Loading**

In [13]:
# csv = read_csv
# xlsx, xlx = read_excel
# json = read_json
# sql or mysql = read_sql

df1 = pd.read_csv(r'data.csv')
df1

    Name  Age     City
0  Pavan   18   Mumbai
1   ravi   21  Gujrath
2  Pavan   18   Mumbai

In [14]:
# to_csv = csv
# to_excel = xlsx
# to_json = json
df.to_excel('data.xlsx', sheet_name='Data')

In [15]:
import pandas as pd

In [16]:
df = pd.read_excel('data.xlsx', sheet_name='Data') # OneDrive/Documents/Python/data.xlsx
df

    Unnamed: 0     Name   Age      City   Salary        Date Category
0            0    Alice  45.0  New York  95445.0  2023-01-01        A
1            1      Bob  58.0    London  86235.0  2023-01-02        B
2            2  Charlie  60.0     Tokyo  62330.0  2023-01-03        C
3            3    David  28.0     Paris  46022.0  2023-01-04        A
4            4      Eva  49.0    Berlin  65999.0  2023-01-05        B
5            5    Frank  67.0     Paris  88320.0  2023-01-06        A
6            6    Grace   NaN    Berlin  57141.0  2023-01-07        C
7            7   Hannah  60.0  New York  65413.0  2023-01-08        B
8            8     Ivan  37.0     Tokyo  87016.0  2023-01-09        A
9            9     Jack  31.0    London  58725.0  2023-01-10        B
10          10     Ivan  37.0     Tokyo  87016.0  2023-01-09        A
11          11     Jack  31.0    London  58725.0  2023-01-10        B
12          12    Grace  29.0    Berlin  57141.0  2023-01-07      NaN
13          13   Hannah  60.0  New York      NaN  2023-01-08        B

### **Data exploration**

In [18]:
df.head(10)

   Unnamed: 0     Name   Age      City   Salary        Date Category
0           0    Alice  45.0  New York  95445.0  2023-01-01        A
1           1      Bob  58.0    London  86235.0  2023-01-02        B
2           2  Charlie  60.0     Tokyo  62330.0  2023-01-03        C
3           3    David  28.0     Paris  46022.0  2023-01-04        A
4           4      Eva  49.0    Berlin  65999.0  2023-01-05        B
5           5    Frank  67.0     Paris  88320.0  2023-01-06        A
6           6    Grace   NaN    Berlin  57141.0  2023-01-07        C
7           7   Hannah  60.0  New York  65413.0  2023-01-08        B
8           8     Ivan  37.0     Tokyo  87016.0  2023-01-09        A
9           9     Jack  31.0    London  58725.0  2023-01-10        B

In [19]:
df.head(10) # top rows

   Unnamed: 0     Name   Age      City   Salary        Date Category
0           0    Alice  45.0  New York  95445.0  2023-01-01        A
1           1      Bob  58.0    London  86235.0  2023-01-02        B
2           2  Charlie  60.0     Tokyo  62330.0  2023-01-03        C
3           3    David  28.0     Paris  46022.0  2023-01-04        A
4           4      Eva  49.0    Berlin  65999.0  2023-01-05        B
5           5    Frank  67.0     Paris  88320.0  2023-01-06        A
6           6    Grace   NaN    Berlin  57141.0  2023-01-07        C
7           7   Hannah  60.0  New York  65413.0  2023-01-08        B
8           8     Ivan  37.0     Tokyo  87016.0  2023-01-09        A
9           9     Jack  31.0    London  58725.0  2023-01-10        B

In [20]:
df.tail() # bottom rows

    Unnamed: 0    Name   Age      City   Salary        Date Category
9            9    Jack  31.0    London  58725.0  2023-01-10        B
10          10    Ivan  37.0     Tokyo  87016.0  2023-01-09        A
11          11    Jack  31.0    London  58725.0  2023-01-10        B
12          12   Grace  29.0    Berlin  57141.0  2023-01-07      NaN
13          13  Hannah  60.0  New York      NaN  2023-01-08        B

In [21]:
df.info() # entire information about the dataset

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14 entries, 0 to 13
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  14 non-null     int64
 1   Name        14 non-null     object
 2   Age         13 non-null     float64
 3   City        14 non-null     object
 4   Salary      13 non-null     float64
 5   Date        14 non-null     object
 6   Category    13 non-null     object
dtypes: float64(2), int64(1), object(4)
memory usage: 916.0+ bytes

In [22]:
df.describe() #statistical discription of data only numaricle

       Unnamed: 0        Age        Salary
count     14.0000  13.000000     13.000000
mean       6.5000  45.538462  70425.230769
std        4.1833  14.157539  16018.646562
min        0.0000  28.000000  46022.000000
25%        3.2500  31.000000  58725.000000
50%        6.5000  45.000000  65413.000000
75%        9.7500  60.000000  87016.000000
max       13.0000  67.000000  95445.000000

In [23]:
df.describe(include='all') # categoricle = 'object', Numaricle = 'np.number' or 'int' and 'float'

,Unnamed: 0,Name,Age,City,Salary,Date,Category
count,14.0000,14,13.000000,14,13.000000,14,13
unique,NaN,10,NaN,5,NaN,10,3
top,NaN,Ivan,NaN,New York,NaN,2023-01-09,B
freq,NaN,2,NaN,3,NaN,2,6
mean,6.5000,NaN,45.538462,NaN,70425.230769,NaN,NaN
std,4.1833,NaN,14.157539,NaN,16018.646562,NaN,NaN
min,0.0000,NaN,28.000000,NaN,46022.000000,NaN,NaN
25%,3.2500,NaN,31.000000,NaN,58725.000000,NaN,NaN
50%,6.5000,NaN,45.000000,NaN,65413.000000,NaN,NaN
75%,9.7500,NaN,60.000000,NaN,87016.000000,NaN,NaN
max,13.0000,NaN,67.000000,NaN,95445.000000,NaN,NaN

In [24]:
df.shape  # no () , it shows dimentionality of the data

(14, 7)

In [25]:
df.shape[0]

14

In [26]:
df.size # shows no of elements

98

In [27]:
df.columns #is shows the columns names

Index(['Unnamed: 0', 'Name', 'Age', 'City', 'Salary', 'Date', 'Category'], dtype='object')

In [28]:
df.dtypes # datatype of each column

Unnamed: 0      int64
Name           object
Age           float64
City           object
Salary        float64
Date           object
Category       object
dtype: object

In [29]:
df.Name

0       Alice
1         Bob
2     Charlie
3       David
4         Eva
5       Frank
6       Grace
7      Hannah
8        Ivan
9        Jack
10       Ivan
11       Jack
12      Grace
13     Hannah
Name: Name, dtype: object

In [30]:
df[['Name','Age']]

       Name   Age
0     Alice  45.0
1       Bob  58.0
2   Charlie  60.0
3     David  28.0
4       Eva  49.0
5     Frank  67.0
6     Grace   NaN
7    Hannah  60.0
8      Ivan  37.0
9      Jack  31.0
10     Ivan  37.0
11     Jack  31.0
12    Grace  29.0
13   Hannah  60.0

### **Data Preprocessing**

#### **Data cleaning**

In [33]:
data = pd.DataFrame({'A': [1, 2, None, 4, None, 6, 7, 1, 100], 'B': [7, None, 9, None, 11, None,50, 7, 7]})
data

       A     B
0    1.0   7.0
1    2.0   NaN
2    NaN   9.0
3    4.0   NaN
4    NaN  11.0
5    6.0   NaN
6    7.0  50.0
7    1.0   7.0
8  100.0   7.0

In [34]:
## finding
data.isnull().sum() # finding missing values

A    2
B    3
dtype: int64

In [35]:
data.isna().sum() # finding missing values

A    2
B    3
dtype: int64

In [36]:
data.duplicated().sum() # finding the duplicates

np.int64(1)

In [37]:
## finding the ouliers
def find_outlier(df, columns):
    outlier_indices = set() # remove the duplicate auto, and sort auto
    
    for col in columns:
        # IQR Method
        Q1 = df[col].quantile(0.25)
        Q3 = df[col].quantile(0.75)
        IQR = Q3 - Q1
        lower_bound = Q1 - 1.5 * IQR
        upper_bound = Q3 + 1.5 * IQR
        col_outliers = df[(df[col] < lower_bound) | (df[col] > upper_bound)]
        outlier_indices.update(col_outliers.index)
        
    return df.loc[list(outlier_indices)]

outliers = find_outlier(data, ['A', 'B'])
print(outliers)

       A     B
8  100.0   7.0
6    7.0  50.0

In [38]:
# Handling the missing values

In [39]:
data.dropna()

       A     B
0    1.0   7.0
6    7.0  50.0
7    1.0   7.0
8  100.0   7.0

In [40]:
data.dropna(subset=['B'])

       A     B
0    1.0   7.0
2    NaN   9.0
4    NaN  11.0
6    7.0  50.0
7    1.0   7.0
8  100.0   7.0

In [41]:
data

       A     B
0    1.0   7.0
1    2.0   NaN
2    NaN   9.0
3    4.0   NaN
4    NaN  11.0
5    6.0   NaN
6    7.0  50.0
7    1.0   7.0
8  100.0   7.0

In [42]:
data['A'].fillna(round(data['A'].mean(), 2))

0      1.00
1      2.00
2     17.29
3      4.00
4     17.29
5      6.00
6      7.00
7      1.00
8    100.00
Name: A, dtype: float64

In [43]:
data.drop_duplicates(inplace=True)

In [44]:
data

       A     B
0    1.0   7.0
1    2.0   NaN
2    NaN   9.0
3    4.0   NaN
4    NaN  11.0
5    6.0   NaN
6    7.0  50.0
8  100.0   7.0

In [45]:
import numpy as np
def log_transform(df, columns):
    transformed_df = df.copy()
    
    for col in columns:
        transformed_df[col] = np.log1p(transformed_df[col]) # log1p(x) = log(1 + x) to avoid division by zero
    
    return transformed_df

log = log_transform(data, ['A', 'B'])
print(log)

          A         B
0  0.693147  2.079442
1  1.098612       NaN
2       NaN  2.302585
3  1.609438       NaN
4       NaN  2.484907
5  1.945910       NaN
6  2.079442  3.931826
8  4.615121  2.079442

In [46]:
df

    Unnamed: 0     Name   Age      City   Salary        Date Category
0            0    Alice  45.0  New York  95445.0  2023-01-01        A
1            1      Bob  58.0    London  86235.0  2023-01-02        B
2            2  Charlie  60.0     Tokyo  62330.0  2023-01-03        C
3            3    David  28.0     Paris  46022.0  2023-01-04        A
4            4      Eva  49.0    Berlin  65999.0  2023-01-05        B
5            5    Frank  67.0     Paris  88320.0  2023-01-06        A
6            6    Grace   NaN    Berlin  57141.0  2023-01-07        C
7            7   Hannah  60.0  New York  65413.0  2023-01-08        B
8            8     Ivan  37.0     Tokyo  87016.0  2023-01-09        A
9            9     Jack  31.0    London  58725.0  2023-01-10        B
10          10     Ivan  37.0     Tokyo  87016.0  2023-01-09        A
11          11     Jack  31.0    London  58725.0  2023-01-10        B
12          12    Grace  29.0    Berlin  57141.0  2023-01-07      NaN
13          13   Hannah  60.0  New York      NaN  2023-01-08        B

In [47]:
import warnings
warnings.filterwarnings('ignore')

df['Age'].fillna(round(df['Age'].mean(), 2), inplace=True)
df['Salary'].fillna(round(df['Salary'].mean(), 2), inplace=True)
df['Category'].fillna(df['Category'].mode()[0], inplace=True)

In [48]:
df.duplicated().sum()

np.int64(0)

### **Data Manupulation**

In [50]:
df[df['City'].str.contains('New')]

    Unnamed: 0    Name   Age      City    Salary        Date Category
0            0   Alice  45.0  New York  95445.00  2023-01-01        A
7            7  Hannah  60.0  New York  65413.00  2023-01-08        B
13          13  Hannah  60.0  New York  70425.23  2023-01-08        B

In [51]:
df[df['City'].str.contains('New', case=False)] #to avoide upper case lower case

    Unnamed: 0    Name   Age      City    Salary        Date Category
0            0   Alice  45.0  New York  95445.00  2023-01-01        A
7            7  Hannah  60.0  New York  65413.00  2023-01-08        B
13          13  Hannah  60.0  New York  70425.23  2023-01-08        B

In [52]:
df['City'].str.split(' ')

0     [New, York]
1        [London]
2         [Tokyo]
3         [Paris]
4        [Berlin]
5         [Paris]
6        [Berlin]
7     [New, York]
8         [Tokyo]
9        [London]
10        [Tokyo]
11       [London]
12       [Berlin]
13    [New, York]
Name: City, dtype: object

In [53]:
df['City'].str.split(' ').str.get(0) #extracting first elemet in the list

0        New
1     London
2      Tokyo
3      Paris
4     Berlin
5      Paris
6     Berlin
7        New
8      Tokyo
9     London
10     Tokyo
11    London
12    Berlin
13       New
Name: City, dtype: object

In [54]:
df[df['Category'].str.startswith('A')]

    Unnamed: 0   Name   Age      City   Salary        Date Category
0            0  Alice  45.0  New York  95445.0  2023-01-01        A
3            3  David  28.0     Paris  46022.0  2023-01-04        A
5            5  Frank  67.0     Paris  88320.0  2023-01-06        A
8            8   Ivan  37.0     Tokyo  87016.0  2023-01-09        A
10          10   Ivan  37.0     Tokyo  87016.0  2023-01-09        A

In [55]:
df[df['City'].str.endswith('o')]

    Unnamed: 0     Name   Age   City   Salary        Date Category
2            2  Charlie  60.0  Tokyo  62330.0  2023-01-03        C
8            8     Ivan  37.0  Tokyo  87016.0  2023-01-09        A
10          10     Ivan  37.0  Tokyo  87016.0  2023-01-09        A

In [56]:
df['Name1'] = df['Name'].str.upper()

In [57]:
df

,Unnamed: 0,Name,Age,City,Salary,Date,Category,Name1
0,0,Alice,45.00,New York,95445.00,2023-01-01,A,ALICE
1,1,Bob,58.00,London,86235.00,2023-01-02,B,BOB
2,2,Charlie,60.00,Tokyo,62330.00,2023-01-03,C,CHARLIE
3,3,David,28.00,Paris,46022.00,2023-01-04,A,DAVID
4,4,Eva,49.00,Berlin,65999.00,2023-01-05,B,EVA
5,5,Frank,67.00,Paris,88320.00,2023-01-06,A,FRANK
6,6,Grace,45.54,Berlin,57141.00,2023-01-07,C,GRACE
7,7,Hannah,60.00,New York,65413.00,2023-01-08,B,HANNAH
8,8,Ivan,37.00,Tokyo,87016.00,2023-01-09,A,IVAN
9,9,Jack,31.00,London,58725.00,2023-01-10,B,JACK
10,10,Ivan,37.00,Tokyo,87016.00,2023-01-09,A,IVAN
11,11,Jack,31.00,London,58725.00,2023-01-10,B,JACK
12,12,Grace,29.00,Berlin,57141.00,2023-01-07,B,GRACE
13,13,Hannah,60.00,New York,70425.23,2023-01-08,B,HANNAH

In [58]:
df['Name1'] = df['Name1'].str.lower()

In [59]:
df

,Unnamed: 0,Name,Age,City,Salary,Date,Category,Name1
0,0,Alice,45.00,New York,95445.00,2023-01-01,A,alice
1,1,Bob,58.00,London,86235.00,2023-01-02,B,bob
2,2,Charlie,60.00,Tokyo,62330.00,2023-01-03,C,charlie
3,3,David,28.00,Paris,46022.00,2023-01-04,A,david
4,4,Eva,49.00,Berlin,65999.00,2023-01-05,B,eva
5,5,Frank,67.00,Paris,88320.00,2023-01-06,A,frank
6,6,Grace,45.54,Berlin,57141.00,2023-01-07,C,grace
7,7,Hannah,60.00,New York,65413.00,2023-01-08,B,hannah
8,8,Ivan,37.00,Tokyo,87016.00,2023-01-09,A,ivan
9,9,Jack,31.00,London,58725.00,2023-01-10,B,jack
10,10,Ivan,37.00,Tokyo,87016.00,2023-01-09,A,ivan
11,11,Jack,31.00,London,58725.00,2023-01-10,B,jack
12,12,Grace,29.00,Berlin,57141.00,2023-01-07,B,grace
13,13,Hannah,60.00,New York,70425.23,2023-01-08,B,hannah

In [60]:
df['Name'].str.replace('a', 'A')

0       Alice
1         Bob
2     ChArlie
3       DAvid
4         EvA
5       FrAnk
6       GrAce
7      HAnnAh
8        IvAn
9        JAck
10       IvAn
11       JAck
12      GrAce
13     HAnnAh
Name: Name, dtype: object

### **Slicing And Indexing**

In [61]:
df['Name'] # df.Name

0       Alice
1         Bob
2     Charlie
3       David
4         Eva
5       Frank
6       Grace
7      Hannah
8        Ivan
9        Jack
10       Ivan
11       Jack
12      Grace
13     Hannah
Name: Name, dtype: object

In [62]:
df[['Name','Age']]

       Name    Age
0     Alice  45.00
1       Bob  58.00
2   Charlie  60.00
3     David  28.00
4       Eva  49.00
5     Frank  67.00
6     Grace  45.54
7    Hannah  60.00
8      Ivan  37.00
9      Jack  31.00
10     Ivan  37.00
11     Jack  31.00
12    Grace  29.00
13   Hannah  60.00

In [63]:
df[0:5]

   Unnamed: 0     Name   Age      City   Salary        Date Category    Name1
0           0    Alice  45.0  New York  95445.0  2023-01-01        A    alice
1           1      Bob  58.0    London  86235.0  2023-01-02        B      bob
2           2  Charlie  60.0     Tokyo  62330.0  2023-01-03        C  charlie
3           3    David  28.0     Paris  46022.0  2023-01-04        A    david
4           4      Eva  49.0    Berlin  65999.0  2023-01-05        B      eva

In [64]:
df[:-1:2]

,Unnamed: 0,Name,Age,City,Salary,Date,Category,Name1
0,0,Alice,45.00,New York,95445.0,2023-01-01,A,alice
2,2,Charlie,60.00,Tokyo,62330.0,2023-01-03,C,charlie
4,4,Eva,49.00,Berlin,65999.0,2023-01-05,B,eva
6,6,Grace,45.54,Berlin,57141.0,2023-01-07,C,grace
8,8,Ivan,37.00,Tokyo,87016.0,2023-01-09,A,ivan
10,10,Ivan,37.00,Tokyo,87016.0,2023-01-09,A,ivan
12,12,Grace,29.00,Berlin,57141.0,2023-01-07,B,grace

In [65]:
df.loc[: , 'Name':'Salary']

       Name    Age      City    Salary
0     Alice  45.00  New York  95445.00
1       Bob  58.00    London  86235.00
2   Charlie  60.00     Tokyo  62330.00
3     David  28.00     Paris  46022.00
4       Eva  49.00    Berlin  65999.00
5     Frank  67.00     Paris  88320.00
6     Grace  45.54    Berlin  57141.00
7    Hannah  60.00  New York  65413.00
8      Ivan  37.00     Tokyo  87016.00
9      Jack  31.00    London  58725.00
10     Ivan  37.00     Tokyo  87016.00
11     Jack  31.00    London  58725.00
12    Grace  29.00    Berlin  57141.00
13   Hannah  60.00  New York  70425.23

In [66]:
df.loc[0:6, 'City':'Category'] #Categorical Acessing there is no excluding

       City   Salary        Date Category
0  New York  95445.0  2023-01-01        A
1    London  86235.0  2023-01-02        B
2     Tokyo  62330.0  2023-01-03        C
3     Paris  46022.0  2023-01-04        A
4    Berlin  65999.0  2023-01-05        B
5     Paris  88320.0  2023-01-06        A
6    Berlin  57141.0  2023-01-07        C

In [67]:
df.iloc[0:6,3:8] #numarical acesscing starting will be including ending will be excluding

       City   Salary        Date Category    Name1
0  New York  95445.0  2023-01-01        A    alice
1    London  86235.0  2023-01-02        B      bob
2     Tokyo  62330.0  2023-01-03        C  charlie
3     Paris  46022.0  2023-01-04        A    david
4    Berlin  65999.0  2023-01-05        B      eva
5     Paris  88320.0  2023-01-06        A    frank

In [68]:
df.iloc[:, 1:5]

       Name    Age      City    Salary
0     Alice  45.00  New York  95445.00
1       Bob  58.00    London  86235.00
2   Charlie  60.00     Tokyo  62330.00
3     David  28.00     Paris  46022.00
4       Eva  49.00    Berlin  65999.00
5     Frank  67.00     Paris  88320.00
6     Grace  45.54    Berlin  57141.00
7    Hannah  60.00  New York  65413.00
8      Ivan  37.00     Tokyo  87016.00
9      Jack  31.00    London  58725.00
10     Ivan  37.00     Tokyo  87016.00
11     Jack  31.00    London  58725.00
12    Grace  29.00    Berlin  57141.00
13   Hannah  60.00  New York  70425.23

In [69]:
df[df['Age'] >=30]

,Unnamed: 0,Name,Age,City,Salary,Date,Category,Name1
0,0,Alice,45.00,New York,95445.00,2023-01-01,A,alice
1,1,Bob,58.00,London,86235.00,2023-01-02,B,bob
2,2,Charlie,60.00,Tokyo,62330.00,2023-01-03,C,charlie
4,4,Eva,49.00,Berlin,65999.00,2023-01-05,B,eva
5,5,Frank,67.00,Paris,88320.00,2023-01-06,A,frank
6,6,Grace,45.54,Berlin,57141.00,2023-01-07,C,grace
7,7,Hannah,60.00,New York,65413.00,2023-01-08,B,hannah
8,8,Ivan,37.00,Tokyo,87016.00,2023-01-09,A,ivan
9,9,Jack,31.00,London,58725.00,2023-01-10,B,jack
10,10,Ivan,37.00,Tokyo,87016.00,2023-01-09,A,ivan
11,11,Jack,31.00,London,58725.00,2023-01-10,B,jack
13,13,Hannah,60.00,New York,70425.23,2023-01-08,B,hannah

In [70]:
df[(df['Age']>=30) & (df['Category'] == 'B')]

    Unnamed: 0    Name   Age      City    Salary        Date Category   Name1
1            1     Bob  58.0    London  86235.00  2023-01-02        B     bob
4            4     Eva  49.0    Berlin  65999.00  2023-01-05        B     eva
7            7  Hannah  60.0  New York  65413.00  2023-01-08        B  hannah
9            9    Jack  31.0    London  58725.00  2023-01-10        B    jack
11          11    Jack  31.0    London  58725.00  2023-01-10        B    jack
13          13  Hannah  60.0  New York  70425.23  2023-01-08        B  hannah

In [71]:
df[df['Category'].isin(['A','C','D','E'])]

,Unnamed: 0,Name,Age,City,Salary,Date,Category,Name1
0,0,Alice,45.00,New York,95445.0,2023-01-01,A,alice
2,2,Charlie,60.00,Tokyo,62330.0,2023-01-03,C,charlie
3,3,David,28.00,Paris,46022.0,2023-01-04,A,david
5,5,Frank,67.00,Paris,88320.0,2023-01-06,A,frank
6,6,Grace,45.54,Berlin,57141.0,2023-01-07,C,grace
8,8,Ivan,37.00,Tokyo,87016.0,2023-01-09,A,ivan
10,10,Ivan,37.00,Tokyo,87016.0,2023-01-09,A,ivan

In [72]:
df.query('Age > 30')

,Unnamed: 0,Name,Age,City,Salary,Date,Category,Name1
0,0,Alice,45.00,New York,95445.00,2023-01-01,A,alice
1,1,Bob,58.00,London,86235.00,2023-01-02,B,bob
2,2,Charlie,60.00,Tokyo,62330.00,2023-01-03,C,charlie
4,4,Eva,49.00,Berlin,65999.00,2023-01-05,B,eva
5,5,Frank,67.00,Paris,88320.00,2023-01-06,A,frank
6,6,Grace,45.54,Berlin,57141.00,2023-01-07,C,grace
7,7,Hannah,60.00,New York,65413.00,2023-01-08,B,hannah
8,8,Ivan,37.00,Tokyo,87016.00,2023-01-09,A,ivan
9,9,Jack,31.00,London,58725.00,2023-01-10,B,jack
10,10,Ivan,37.00,Tokyo,87016.00,2023-01-09,A,ivan
11,11,Jack,31.00,London,58725.00,2023-01-10,B,jack
13,13,Hannah,60.00,New York,70425.23,2023-01-08,B,hannah

In [73]:
df.query('Category == "A"')

    Unnamed: 0   Name   Age      City   Salary        Date Category  Name1
0            0  Alice  45.0  New York  95445.0  2023-01-01        A  alice
3            3  David  28.0     Paris  46022.0  2023-01-04        A  david
5            5  Frank  67.0     Paris  88320.0  2023-01-06        A  frank
8            8   Ivan  37.0     Tokyo  87016.0  2023-01-09        A   ivan
10          10   Ivan  37.0     Tokyo  87016.0  2023-01-09        A   ivan

In [74]:
# modified a values

In [75]:
df['Name'][4]

'Eva'

In [76]:
df['Name'][4] = 'Niranjan'

In [77]:
df['Name'][4]

'Niranjan'

In [78]:
df.loc[4, ['Name', 'Age']] = ['Niranjann', 24]

In [79]:
## adding A new rows

In [80]:
df.columns

Index(['Unnamed: 0', 'Name', 'Age', 'City', 'Salary', 'Date', 'Category',
       'Name1'],
      dtype='object')

In [81]:
df.loc[14] = {'Unnamed: 0':14, 'Name':'Deekeshitha', 'Age':24, 'City':'Blore', 'Salary':50000, 'Date':'10-06-2025', 'Category':'D','Name1':'deekshitha'}

In [82]:
df.loc[15] = [15, 'Roshan', 23, 'Jaipur', 40000, '2025-06-10', 'D', 'roshan']

In [83]:
## removing column and rows

In [84]:
df.drop(columns=['Unnamed: 0', 'Name1'], inplace=True)

In [85]:
df.drop([14,15], inplace=True)

In [86]:
df

         Name    Age      City    Salary        Date Category
0       Alice  45.00  New York  95445.00  2023-01-01        A
1         Bob  58.00    London  86235.00  2023-01-02        B
2     Charlie  60.00     Tokyo  62330.00  2023-01-03        C
3       David  28.00     Paris  46022.00  2023-01-04        A
4   Niranjann  24.00    Berlin  65999.00  2023-01-05        B
5       Frank  67.00     Paris  88320.00  2023-01-06        A
6       Grace  45.54    Berlin  57141.00  2023-01-07        C
7      Hannah  60.00  New York  65413.00  2023-01-08        B
8        Ivan  37.00     Tokyo  87016.00  2023-01-09        A
9        Jack  31.00    London  58725.00  2023-01-10        B
10       Ivan  37.00     Tokyo  87016.00  2023-01-09        A
11       Jack  31.00    London  58725.00  2023-01-10        B
12      Grace  29.00    Berlin  57141.00  2023-01-07        B
13     Hannah  60.00  New York  70425.23  2023-01-08        B

### **Statstical Functions**

In [88]:
df['Salary'].sum()

np.float64(985953.23)

In [89]:
df['Salary'].min()

np.float64(46022.0)

In [90]:
df['Salary'].max()

np.float64(95445.0)

In [91]:
df['Salary'].count()

np.int64(14)

In [92]:
df['Salary'].mean()

np.float64(70425.23071428572)

In [93]:
df['Salary'].median()

np.float64(65706.0)

In [94]:
df['Salary'].var()

np.float64(236858804.02366865)

In [95]:
df['Salary'].std()

np.float64(15390.217802996443)

In [96]:
np.sqrt(9)

np.float64(3.0)

In [97]:
np.power(2,3)

np.int64(8)

### **Transformation**

In [99]:
df['Age'].dtype

dtype('float64')

In [100]:
df['Age'] = df['Age'].astype('int')

In [101]:
# rename columns
df.rename(columns={'Name':'First_Name'}, inplace=True)

In [102]:
df.columns

Index(['First_Name', 'Age', 'City', 'Salary', 'Date', 'Category'], dtype='object')

### **Special Functions**

In [104]:
df['Category'].unique()

array(['A', 'B', 'C'], dtype=object)

In [105]:
df['Category'].nunique()

3

In [106]:
df.nunique()

First_Name    10
Age            9
City           5
Salary        11
Date          10
Category       3
dtype: int64

In [107]:
df['Age'].nsmallest(10)

4     24
3     28
12    29
9     31
11    31
8     37
10    37
0     45
6     45
1     58
Name: Age, dtype: int64

In [108]:
df['Age'].nlargest(10)

5     67
2     60
7     60
13    60
1     58
0     45
6     45
8     37
10    37
9     31
Name: Age, dtype: int64

In [109]:
df['Category'].value_counts() # Finding the unique value counts in the column

Category
B    7
A    5
C    2
Name: count, dtype: int64

In [110]:
count_age = df['Age'].value_counts()
print(count_age.index)
print(count_age.values)

Index([60, 45, 37, 31, 58, 24, 28, 67, 29], dtype='int64', name='Age')
[3 2 2 2 1 1 1 1 1]

In [111]:
df.sort_values(by='Age') # sorting by ascending

   First_Name  Age      City    Salary        Date Category
4   Niranjann   24    Berlin  65999.00  2023-01-05        B
3       David   28     Paris  46022.00  2023-01-04        A
12      Grace   29    Berlin  57141.00  2023-01-07        B
9        Jack   31    London  58725.00  2023-01-10        B
11       Jack   31    London  58725.00  2023-01-10        B
8        Ivan   37     Tokyo  87016.00  2023-01-09        A
10       Ivan   37     Tokyo  87016.00  2023-01-09        A
6       Grace   45    Berlin  57141.00  2023-01-07        C
0       Alice   45  New York  95445.00  2023-01-01        A
1         Bob   58    London  86235.00  2023-01-02        B
2     Charlie   60     Tokyo  62330.00  2023-01-03        C
7      Hannah   60  New York  65413.00  2023-01-08        B
13     Hannah   60  New York  70425.23  2023-01-08        B
5       Frank   67     Paris  88320.00  2023-01-06        A

In [112]:
df.sort_values(by='Age', ascending=False) # sorting by descending

   First_Name  Age      City    Salary        Date Category
5       Frank   67     Paris  88320.00  2023-01-06        A
2     Charlie   60     Tokyo  62330.00  2023-01-03        C
13     Hannah   60  New York  70425.23  2023-01-08        B
7      Hannah   60  New York  65413.00  2023-01-08        B
1         Bob   58    London  86235.00  2023-01-02        B
0       Alice   45  New York  95445.00  2023-01-01        A
6       Grace   45    Berlin  57141.00  2023-01-07        C
8        Ivan   37     Tokyo  87016.00  2023-01-09        A
10       Ivan   37     Tokyo  87016.00  2023-01-09        A
9        Jack   31    London  58725.00  2023-01-10        B
11       Jack   31    London  58725.00  2023-01-10        B
12      Grace   29    Berlin  57141.00  2023-01-07        B
3       David   28     Paris  46022.00  2023-01-04        A
4   Niranjann   24    Berlin  65999.00  2023-01-05        B

In [127]:
df['Category'].replace({"A":"X", "B":"Y","C":"Z"}, inplace = True)

### **Data Aggregation**

In [129]:
df.groupby('City').agg({'Age':'mean'})

                Age
City
Berlin    32.666667
London    40.000000
New York  55.000000
Paris     47.500000
Tokyo     44.666667

In [130]:
df.groupby('Category')['Salary'].sum()

Category
X    403819.00
Y    462663.23
Z    119471.00
Name: Salary, dtype: float64

In [131]:
df.groupby(['Category', 'First_Name']).agg({'Salary':'sum'}).reset_index()

   Category First_Name     Salary
0         X      Alice   95445.00
1         X      David   46022.00
2         X      Frank   88320.00
3         X       Ivan  174032.00
4         Y        Bob   86235.00
5         Y      Grace   57141.00
6         Y     Hannah  135838.23
7         Y       Jack  117450.00
8         Y  Niranjann   65999.00
9         Z    Charlie   62330.00
10        Z      Grace   57141.00

In [132]:
df.groupby('City').agg({'Age':'mean', 'Salary':'sum'}).reset_index()

       City        Age     Salary
0    Berlin  32.666667  180281.00
1    London  40.000000  203685.00
2  New York  55.000000  231283.23
3     Paris  47.500000  134342.00
4     Tokyo  44.666667  236362.00

### **Applying function**

In [134]:
def category(col):
    if col <=12:
        return "Young"
    elif col <=19:
        return "Tean Age"
    elif col <= 45:
        return "Middle Age"
    else:
        return "Seniors"

In [135]:
df['Age Category'] = df['Age'].apply(category)

In [136]:
df

   First_Name  Age      City    Salary        Date Category Age Category
0       Alice   45  New York  95445.00  2023-01-01        X   Middle Age
1         Bob   58    London  86235.00  2023-01-02        Y      Seniors
2     Charlie   60     Tokyo  62330.00  2023-01-03        Z      Seniors
3       David   28     Paris  46022.00  2023-01-04        X   Middle Age
4   Niranjann   24    Berlin  65999.00  2023-01-05        Y   Middle Age
5       Frank   67     Paris  88320.00  2023-01-06        X      Seniors
6       Grace   45    Berlin  57141.00  2023-01-07        Z   Middle Age
7      Hannah   60  New York  65413.00  2023-01-08        Y      Seniors
8        Ivan   37     Tokyo  87016.00  2023-01-09        X   Middle Age
9        Jack   31    London  58725.00  2023-01-10        Y   Middle Age
10       Ivan   37     Tokyo  87016.00  2023-01-09        X   Middle Age
11       Jack   31    London  58725.00  2023-01-10        Y   Middle Age
12      Grace   29    Berlin  57141.00  2023-01-07        Y   Middle Age
13     Hannah   60  New York  70425.23  2023-01-08        Y      Seniors

In [137]:
data = {'A': [1, 2, 3], 'B': [4, 5, 6], 'C': [7, 8, 9]}
df3 = pd.DataFrame(data)
df3

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

In [138]:
def double(x):
    return x*2
df3.apply(double)

   A   B   C
0  2   8  14
1  4  10  16
2  6  12  18

In [139]:
def div(x):
    return x%2==0

res = df3[df3.apply(div)]
res1 = df3[df3.applymap(div)]
print(res,'\n',res1)

     A    B    C
0  NaN  4.0  NaN
1  2.0  NaN  8.0
2  NaN  6.0  NaN
      A    B    C
0  NaN  4.0  NaN
1  2.0  NaN  8.0
2  NaN  6.0  NaN

### **Data Merge and Joining**

In [141]:
left_data = {
    'ID': [1, 2, 3, 4, 5],
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'Age': [25, 30, 35, 28, 24],
}

left_df = pd.DataFrame(left_data)

# Sample data for right DataFrame
right_data = {
    'ID': [1, 2, 4, 5, 6],
    'City': ['New York', 'London', 'Paris', 'Berlin', 'Tokyo'],
    'Salary': [60000, 75000, 62000, 57000, 80000],
}

right_df = pd.DataFrame(right_data)

In [142]:
left_df

   ID     Name  Age
0   1    Alice   25
1   2      Bob   30
2   3  Charlie   35
3   4    David   28
4   5      Eva   24

In [143]:
right_df

   ID      City  Salary
0   1  New York   60000
1   2    London   75000
2   4     Paris   62000
3   5    Berlin   57000
4   6     Tokyo   80000

In [144]:
df1 = pd.merge(left_df, right_df, on='ID')
df1

   ID   Name  Age      City  Salary
0   1  Alice   25  New York   60000
1   2    Bob   30    London   75000
2   4  David   28     Paris   62000
3   5    Eva   24    Berlin   57000

In [145]:
inner_join = pd.merge(left_df, right_df, on='ID', how='inner')
inner_join

   ID   Name  Age      City  Salary
0   1  Alice   25  New York   60000
1   2    Bob   30    London   75000
2   4  David   28     Paris   62000
3   5    Eva   24    Berlin   57000

In [146]:
outer_join = pd.merge(left_df, right_df, on='ID', how='outer')
outer_join

   ID     Name   Age      City   Salary
0   1    Alice  25.0  New York  60000.0
1   2      Bob  30.0    London  75000.0
2   3  Charlie  35.0       NaN      NaN
3   4    David  28.0     Paris  62000.0
4   5      Eva  24.0    Berlin  57000.0
5   6      NaN   NaN     Tokyo  80000.0

In [147]:
left_join = pd.merge(left_df, right_df, on='ID', how='left')
left_join

   ID     Name  Age      City   Salary
0   1    Alice   25  New York  60000.0
1   2      Bob   30    London  75000.0
2   3  Charlie   35       NaN      NaN
3   4    David   28     Paris  62000.0
4   5      Eva   24    Berlin  57000.0

In [148]:
right_join = pd.merge(left_df, right_df, on='ID', how='right')
right_join

   ID   Name   Age      City  Salary
0   1  Alice  25.0  New York   60000
1   2    Bob  30.0    London   75000
2   4  David  28.0     Paris   62000
3   5    Eva  24.0    Berlin   57000
4   6    NaN   NaN     Tokyo   80000

### **Time Series Analysis**

In [170]:
from datetime import date as dt

In [171]:
print(dt.__doc__)

date(year, month, day) --> date object

In [178]:
today = dt.today()

In [179]:
today.year

2025

In [181]:
today.month

6

In [182]:
today.day

11

In [207]:
from datetime import datetime
now = datetime.now()
now

datetime.datetime(2025, 6, 11, 15, 29, 29, 779203)

In [210]:
date = now.strftime('%Y-%b-%d')
date

'2025-Jun-11'

In [211]:
date = now.strftime('%Y-%B-%d')
date

'2025-June-11'

In [214]:
date = now.strftime('%Y-%B-%d %a')
date

'2025-June-11 Wed'

In [215]:
date = now.strftime('%Y-%B-%d %A')
date

'2025-June-11 Wednesday'

In [216]:
date = now.strftime('%A %d-%B-%Y')
date

'Wednesday 11-June-2025'

In [184]:
df['Date'].dtype

dtype('O')

In [188]:
df['Date'] = pd.DatetimeIndex(df['Date'])

In [194]:
df['Date'] = pd.to_datetime(df['Date'], format='%Y-%B-%d')

In [195]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 14 entries, 0 to 13
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   First_Name    14 non-null     object
 1   Age           14 non-null     int64
 2   City          14 non-null     object
 3   Salary        14 non-null     float64
 4   Date          14 non-null     datetime64[ns]
 5   Category      14 non-null     object
 6   Age Category  14 non-null     object
dtypes: datetime64[ns](1), float64(1), int64(1), object(4)
memory usage: 1.4+ KB

In [197]:
df

   First_Name  Age      City    Salary       Date Category Age Category
0       Alice   45  New York  95445.00 2023-01-01        X   Middle Age
1         Bob   58    London  86235.00 2023-01-02        Y      Seniors
2     Charlie   60     Tokyo  62330.00 2023-01-03        Z      Seniors
3       David   28     Paris  46022.00 2023-01-04        X   Middle Age
4   Niranjann   24    Berlin  65999.00 2023-01-05        Y   Middle Age
5       Frank   67     Paris  88320.00 2023-01-06        X      Seniors
6       Grace   45    Berlin  57141.00 2023-01-07        Z   Middle Age
7      Hannah   60  New York  65413.00 2023-01-08        Y      Seniors
8        Ivan   37     Tokyo  87016.00 2023-01-09        X   Middle Age
9        Jack   31    London  58725.00 2023-01-10        Y   Middle Age
10       Ivan   37     Tokyo  87016.00 2023-01-09        X   Middle Age
11       Jack   31    London  58725.00 2023-01-10        Y   Middle Age
12      Grace   29    Berlin  57141.00 2023-01-07        Y   Middle Age
13     Hannah   60  New York  70425.23 2023-01-08        Y      Seniors

In [200]:
df['Year_experience'] = today.year - df['Date'].dt.year

In [201]:
df

,First_Name,Age,City,Salary,Date,Category,Age Category,Year_experience
0,Alice,45,New York,95445.00,2023-01-01,X,Middle Age,2
1,Bob,58,London,86235.00,2023-01-02,Y,Seniors,2
2,Charlie,60,Tokyo,62330.00,2023-01-03,Z,Seniors,2
3,David,28,Paris,46022.00,2023-01-04,X,Middle Age,2
4,Niranjann,24,Berlin,65999.00,2023-01-05,Y,Middle Age,2
5,Frank,67,Paris,88320.00,2023-01-06,X,Seniors,2
6,Grace,45,Berlin,57141.00,2023-01-07,Z,Middle Age,2
7,Hannah,60,New York,65413.00,2023-01-08,Y,Seniors,2
8,Ivan,37,Tokyo,87016.00,2023-01-09,X,Middle Age,2
9,Jack,31,London,58725.00,2023-01-10,Y,Middle Age,2
10,Ivan,37,Tokyo,87016.00,2023-01-09,X,Middle Age,2
11,Jack,31,London,58725.00,2023-01-10,Y,Middle Age,2
12,Grace,29,Berlin,57141.00,2023-01-07,Y,Middle Age,2
13,Hannah,60,New York,70425.23,2023-01-08,Y,Seniors,2

In [204]:
date_range = pd.date_range(start='2025-06-11', periods=15, freq='M') # freq='M', 'Y', 'W', 'H', 'T', 'S'
date_range

DatetimeIndex(['2025-06-30', '2025-07-31', '2025-08-31', '2025-09-30',
               '2025-10-31', '2025-11-30', '2025-12-31', '2026-01-31',
               '2026-02-28', '2026-03-31', '2026-04-30', '2026-05-31',
               '2026-06-30', '2026-07-31', '2026-08-31'],
              dtype='datetime64[ns]', freq='ME')

### **Pivot**

In [220]:
df

,First_Name,Age,City,Salary,Date,Category,Age Category,Year_experience
0,Alice,45,New York,95445.00,2023-01-01,X,Middle Age,2
1,Bob,58,London,86235.00,2023-01-02,Y,Seniors,2
2,Charlie,60,Tokyo,62330.00,2023-01-03,Z,Seniors,2
3,David,28,Paris,46022.00,2023-01-04,X,Middle Age,2
4,Niranjann,24,Berlin,65999.00,2023-01-05,Y,Middle Age,2
5,Frank,67,Paris,88320.00,2023-01-06,X,Seniors,2
6,Grace,45,Berlin,57141.00,2023-01-07,Z,Middle Age,2
7,Hannah,60,New York,65413.00,2023-01-08,Y,Seniors,2
8,Ivan,37,Tokyo,87016.00,2023-01-09,X,Middle Age,2
9,Jack,31,London,58725.00,2023-01-10,Y,Middle Age,2
10,Ivan,37,Tokyo,87016.00,2023-01-09,X,Middle Age,2
11,Jack,31,London,58725.00,2023-01-10,Y,Middle Age,2
12,Grace,29,Berlin,57141.00,2023-01-07,Y,Middle Age,2
13,Hannah,60,New York,70425.23,2023-01-08,Y,Seniors,2

In [225]:
df.pivot_table(index='First_Name', columns='Category', values='Salary', aggfunc='count')

Category      X    Y    Z
First_Name
Alice       1.0  NaN  NaN
Bob         NaN  1.0  NaN
Charlie     NaN  NaN  1.0
David       1.0  NaN  NaN
Frank       1.0  NaN  NaN
Grace       NaN  1.0  1.0
Hannah      NaN  2.0  NaN
Ivan        2.0  NaN  NaN
Jack        NaN  2.0  NaN
Niranjann   NaN  1.0  NaN

In [227]:
cross_tab = pd.crosstab(index=[df['First_Name']],
                       columns=df['Category'])

In [228]:
cross_tab

Category    X  Y  Z
First_Name
Alice       1  0  0
Bob         0  1  0
Charlie     0  0  1
David       1  0  0
Frank       1  0  0
Grace       0  1  1
Hannah      0  2  0
Ivan        2  0  0
Jack        0  2  0
Niranjann   0  1  0